InformationRegisters/ПользователиУчетныхЗаписейДокументооборота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПользователиУчетныхЗаписейДокументооборота</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕстьДоступКоВсемГосОрганам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодатьЗаявкуНаПодключениеРПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодатьЗаявкуНаПодключениеФТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодатьЗаявкуНаСертификатДляФСРАР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленияОбИзмененииПрав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдаватьВПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдаватьВРосстат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдаватьВФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдаватьВФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдаватьВЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАдмин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПотенциальныйПользователь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШифровальщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельХраненияЗакрытогоКлюча</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодельХраненияЗакрытогоКлюча</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПросмотраНерасшифрованных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВладелецЭП</Name>
					<Comment>Имеет смысл только для дистанционного подписания</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьУчетныеЗаписиДокументооборота</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиДокументооборота</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ПродлениеСертификатаЭлектроннойПодписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СрокСертификатаСтрока = СтрШаблон(НСтр("ru='Истекает %1'"), Формат(Параметры.СрокСертификата,"ДЛФ=DD"));
	Элементы.СрокСертификатаСтрока.Подсказка = СтрШаблон(НСтр("ru='Отправьте заявление до %1, т.к. может потребоваться 1-2 дня на одобрение заявления.'"),
		Формат(Параметры.СрокОтправкиЗаявления,"ДЛФ=DD"));
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УчетнаяЗаписьОрганизации = ИнтерфейсыВзаимодействияБРОВызовСервера.УчетнаяЗаписьОрганизации(Организация);
	Запрос.УстановитьПараметр("УчетнаяЗаписьОрганизации", УчетнаяЗаписьОрганизации);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиУчетныхЗаписейДокументооборота.Пользователь КАК Пользователь,
		|	ПользователиУчетныхЗаписейДокументооборота.ЭтоАдмин КАК ЭтоАдмин
		|ПОМЕСТИТЬ ПользователиУчетныхЗаписей
		|ИЗ
		|	РегистрСведений.ПользователиУчетныхЗаписейДокументооборота КАК ПользователиУчетныхЗаписейДокументооборота
		|ГДЕ
		|	ПользователиУчетныхЗаписейДокументооборота.УчетнаяЗапись = &УчетнаяЗаписьОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетныеЗаписиДокументооборотаСертификатыЛичные.Пользователь КАК Пользователь,
		|	УчетныеЗаписиДокументооборотаСертификатыЛичные.Отпечаток КАК Отпечаток,
		|	УчетныеЗаписиДокументооборотаСертификатыЛичные.МодельХраненияЗакрытогоКлюча КАК МодельХраненияЗакрытогоКлюча
		|ПОМЕСТИТЬ ДанныеСертификатов
		|ИЗ
		|	Справочник.УчетныеЗаписиДокументооборота.СертификатыЛичные КАК УчетныеЗаписиДокументооборотаСертификатыЛичные
		|ГДЕ
		|	УчетныеЗаписиДокументооборотаСертификатыЛичные.Ссылка = &УчетнаяЗаписьОрганизации
		|	И УчетныеЗаписиДокументооборотаСертификатыЛичные.Текущий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПользователиУчетныхЗаписей.Пользователь КАК Пользователь,
		|	ДанныеСертификатов.Пользователь КАК ПользовательВСертификате,
		|	ПользователиУчетныхЗаписей.ЭтоАдмин КАК ЭтоАдмин
		|ИЗ
		|	ПользователиУчетныхЗаписей КАК ПользователиУчетныхЗаписей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСертификатов КАК ДанныеСертификатов
		|		ПО ПользователиУчетныхЗаписей.Пользователь = ДанныеСертификатов.Пользователь";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ПользователиУчетныхЗаписей = РезультатЗапроса.Выгрузить();
	
	ВладелецСертификата = Неопределено;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		// Пользователь может быть заполнен только при многопользовательской учетной записи.
		Если Мультирежим.ЭтоМультиРежим(УчетнаяЗаписьОрганизации) И Выборка.ЭтоАдмин Тогда
			ВладелецСертификата = Выборка.Пользователь;
			МожноПродлить = (ВладелецСертификата = ТекущийПользователь);
			УправлениеПродлением(МожноПродлить, ВладелецСертификата);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Однопользовательский режим.
	// Сначала проверим, что у пользователя есть права на обмен.
	СписокПользователей.ЗагрузитьЗначения(ПользователиУчетныхЗаписей.ВыгрузитьКолонку("Пользователь"));
	ЭлементСписокПользователей = СписокПользователей.НайтиПоЗначению(ТекущийПользователь);
	Если ЭлементСписокПользователей = Неопределено Тогда
		ВладелецСертификата = ВладелецСертификата(СписокПользователей);
		УправлениеПродлением(Ложь, ВладелецСертификата);
		Возврат;
	Иначе
		СписокПользователей.Удалить(ЭлементСписокПользователей);
	КонецЕсли;
	
	// Продлить сертификат может только тот, у кого сертификат установлен в хранилище сертификатов операционной системы.
	Элементы.ОтправитьЗаявление.Видимость = Ложь;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСертификатов.Отпечаток КАК Отпечаток,
	|	ДанныеСертификатов.МодельХраненияЗакрытогоКлюча КАК МодельХраненияЗакрытогоКлюча
	|ИЗ
	|	ДанныеСертификатов КАК ДанныеСертификатов";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сертификат = Новый Структура();
		Сертификат.Вставить("Отпечаток", Выборка.Отпечаток);
		Сертификат.Вставить("МестоХраненияКлюча", Новый Структура("МодельХраненияЗакрытогоКлюча", Выборка.МодельХраненияЗакрытогоКлюча));
		СертификатыДляПоиска.Добавить(Сертификат);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СертификатыДляПоиска) Тогда
		Оповещение = Новый ОписаниеОповещения("УправлениеПродлениемПослеПоискаСертификата", ЭтотОбъект);
		КриптографияЭДКОКлиент.НайтиСертификаты(Оповещение, СертификатыДляПоиска.ВыгрузитьЗначения(), Ложь, Ложь); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьНеВладелецСертификатаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВладелецСертификата" Тогда
		ПоказатьЗначение(, ВладелецСертификата);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьЗаявление(Команда)
	
	ПараметрыОткрытияМастера = Новый Структура("ПриОткрытииЗапрошеноПродлениеСертификата, ПриОткрытииЗапрошеноПродлениеЛицензии",
		Истина, Ложь);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(
		Организация, ЭтотОбъект, , , ПараметрыОткрытияМастера);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеПродлениемПослеПоискаСертификата(Результат, ДополнителныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат.Сертификаты) Тогда
		УправлениеПродлением(Истина);
		Возврат;
	КонецЕсли;
	
	ВладелецСертификата = ВладелецСертификата(СписокПользователей);
	УправлениеПродлением(Ложь, ВладелецСертификата);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПродлением(МожноПродлить, ДругойПользователь = Неопределено)
	
	Элементы.НадписьНеВладелецСертификата.Видимость = Не МожноПродлить;
	Элементы.ОтправитьЗаявление.Видимость = МожноПродлить;
		
	Если Не МожноПродлить Тогда
		ТекстНадписи =НСтр("ru = 'Сертификат может продлить только сотрудник-владелец сертификата:'");
		ШаблонСтроки = "%1 <a href = ""%2"">%3</a>";
		
		Если ДругойПользователь = Неопределено Тогда
			Элементы.НадписьНеВладелецСертификата.Заголовок = ТекстНадписи;
		Иначе
			Элементы.НадписьНеВладелецСертификата.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				ШаблонСтроки,
				ТекстНадписи,
				"ВладелецСертификата",
				ДругойПользователь.Наименование);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВладелецСертификата(СписокПользователей)
	
	Если СписокПользователей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Владелец сертификата есть в РС ПользователиУчетныхЗаписейДокументооборота,
	// но здесь могут быть все пользователи, для которых возможен обмен.
	ВладелецСертификата = СписокПользователей[0].Значение;
	Если СписокПользователей.Количество() = 1 Тогда
		Возврат ВладелецСертификата;
	КонецЕсли;
	
	// Если несколько пользователей для обмена, то владельца определим из последнего одобренного заявления на подключение.
	ДанныеВладельцаСертификата = ОбработкаЗаявленийАбонентаВызовСервера.ДанныеВладельцаСертификатаЭлектроннойПодписи(Организация);
	Возврат ДанныеВладельцаСертификата.ВладелецЭЦП;
	
КонецФункции

#КонецОбласти
